<a href="https://colab.research.google.com/github/felipemoreia/Awari/blob/master/Exercicios_unidade_4_Manipulacao_de_Dados_Parte_03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Awari - Data Science

## Exercícios Unidade 4 - Parte 3

Neste Jupyter notebook você irá resolver uma exercícios utilizando a linguagem Python e a biblioteca Pandas.

Todos os datasets utilizados nos exercícios estão salvos na pasta **datasets**.

Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

### Tarefa 1. Importe o dataset e salve os dados em um dataframe

Os dados estão salvos no arquivo ***datasets/users_dataset.txt***.

Salve os dados em uma variável de nome *users*.

In [0]:
import pandas as pd

In [0]:
users = pd.read_csv('users_dataset.txt', sep='|')

In [0]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Tarefa 2. Descubra qual a idade média por ocupação.

*Dica: use a função groupby do Pandas na coluna occupation*

In [0]:
users.groupby(['occupation'])['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Tarefa 3. Para cada ocupação descubra a idade mínima e máxima.

In [0]:
users.groupby(['occupation'])['age'].min()

occupation
administrator    21
artist           19
doctor           28
educator         23
engineer         22
entertainment    15
executive        22
healthcare       22
homemaker        20
lawyer           21
librarian        23
marketing        24
none             11
other            13
programmer       20
retired          51
salesman         18
scientist        23
student           7
technician       21
writer           18
Name: age, dtype: int64

In [0]:
users.groupby(['occupation'])['age'].max()

occupation
administrator    70
artist           48
doctor           64
educator         63
engineer         70
entertainment    50
executive        69
healthcare       62
homemaker        50
lawyer           53
librarian        69
marketing        55
none             55
other            64
programmer       63
retired          73
salesman         66
scientist        55
student          42
technician       55
writer           60
Name: age, dtype: int64

### Tarefa 4. Para cada combinação de ocupação e sexo, calcule a idade média.

Exemplo:

```
occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
```

In [0]:
import numpy as np
table = users.pivot_table( values='age', index=['occupation','gender'], aggfunc= np.mean)
print(table)

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000
              M       29.000000
executive     F       44.000000
              M       38.172414
healthcare    F       39.818182
              M       45.400000
homemaker     F       34.166667
              M       23.000000
lawyer        F       39.500000
              M       36.200000
librarian     F       40.000000
              M       40.000000
marketing     F       37.200000
              M       37.875000
none          F       36.500000
              M       18.600000
other         F       35.472222
              M       34.028986
programmer    F       32.166667
              M       33.216667
retired       F       70.000000
              M       62.538462
salesman      F       27.000000
              M       38.555556
scientist     F       28.333333
              M       36.321429
student       F       20.750000
              M       22.669118
technician    F       38.000000
              M       32.961538
writer        F       37.631579
              M       35.346154

### Tarefa 5. Para cada ocupação calcule a porcentagem de homens e mulheres.

Exemplo:

```
occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
```

In [0]:
table1 = users.groupby(['occupation'])['gender'].count()

In [0]:
import numpy as np
table = users.pivot_table(values='age', index=['occupation'], columns=['gender'], aggfunc=len)
table['Total'] = table['M'] + table['F']
table ['percF'] = (table['F']/table['Total'])*100
table ['percM'] = (table['M']/table['Total'])*100
table

gender            F      M  Total      percF      percM
occupation
administrator  36.0   43.0   79.0  45.569620  54.430380
artist         13.0   15.0   28.0  46.428571  53.571429
doctor          NaN    7.0    NaN        NaN        NaN
educator       26.0   69.0   95.0  27.368421  72.631579
engineer        2.0   65.0   67.0   2.985075  97.014925
entertainment   2.0   16.0   18.0  11.111111  88.888889
executive       3.0   29.0   32.0   9.375000  90.625000
healthcare     11.0    5.0   16.0  68.750000  31.250000
homemaker       6.0    1.0    7.0  85.714286  14.285714
lawyer          2.0   10.0   12.0  16.666667  83.333333
librarian      29.0   22.0   51.0  56.862745  43.137255
marketing      10.0   16.0   26.0  38.461538  61.538462
none            4.0    5.0    9.0  44.444444  55.555556
other          36.0   69.0  105.0  34.285714  65.714286
programmer      6.0   60.0   66.0   9.090909  90.909091
retired         1.0   13.0   14.0   7.142857  92.857143
salesman        3.0    9.0   12.0  25.000000  75.000000
scientist       3.0   28.0   31.0   9.677419  90.322581
student        60.0  136.0  196.0  30.612245  69.387755
technician      1.0   26.0   27.0   3.703704  96.296296
writer         19.0   26.0   45.0  42.222222  57.777778

### Awari -  <a href="https://awari.com.br/"> awari.com.br</a>